import os

try:
    TF2_1 = open("TF2_1.txt", "x")
except:
    print("Файл існує")
    
    os.remove("TF2_1.txt")
    TF2_1 = open("TF2_1.txt", "x")
    
title = "Пітон (Python) — рід неотруйних змій з родини пітони. Має 10 видів.\n"
body = "Загальна довжина представників цього роду коливається від 290 до 1220 cм, \n\
деякі часом досягають маси 100 кг. Голова розширена в основі й чітко відокремлена від тулуба. \n\
На міжщелеповому й верхньогубних щитках добре помітні 2-4 глибоких ямки. Зіниці вертикальні. \n\
З боків від анального щитка розташовуються невеликі вирости — рудименти задніх кінцівок.\n\
Усі пітони яйцекладні. Зазвичай вони починають розмножуватися на 4-5-му році життя.\n\
У період парування самиці переносять тривале голодування (5-6 місяців), проте у критичних умовах можуть голодувати й до 1,5 року.\n\
Можуть відкладати до 100 яєць. Самиця повсякчасно знаходиться біля кладки, зігріваючи її.\n"

TF2_1.write(title + body)
TF2_1.close();
TF2_1 = open("TF2_1.txt", "r")

TF2_2 = open("TF2_2.txt", "w")

for str1 in TF2_1:
    counter = 0
    num_str = ""
    
    for char in str1:        
        if (char.isdigit()):
            counter += 1
            num_str += char
        else:
            if counter > 2:
                TF2_2.write(num_str + " ")
            counter = 0
            num_str = ""
    if counter > 2:
        TF2_2.write(num_str + " ")
        
TF2_2.close();
TF2_2 = open("TF2_2.txt", "r")
            
print(TF2_2.read())

TF2_1.close();
TF2_2.close();
    
